src/DataProcessors/РаботаСТранзакциями/РаботаСТранзакциями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСТранзакциями</name>
</mdclass:DataProcessor>

src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагентов</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

src/Enums/КатегорииКонтрагентов/КатегорииКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииКонтрагентов</name>
  <enumValues>
    <name>Важный</name>
  </enumValues>
  <enumValues>
    <name>Обычный</name>
  </enumValues>
  <enumValues>
    <name>Ключевой</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоров</name>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераТелефонов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПривлечения</name>
    <type>
      <types>CatalogRef.ИсточникиПривлечения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>ДопРеквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/РаботаСТранзакциями/Forms/Форма/Module.bsl
&НаСервере
Процедура СоздатьКонтрагента()

	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();

	НовыйКонтрагент.ВидКонтрагента		= Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	НовыйКонтрагент.Категория			= Перечисления.КатегорииКонтрагентов.Обычный;
	НовыйКонтрагент.Покупатель			= Истина;
	НовыйКонтрагент.Наименование		= "Тестовый контрагент";
	НовыйКонтрагент.НаименованиеПолное	= "Тестовый контрагент";
	НовыйКонтрагент.ИНН					= "123";
	
	НовыйКонтрагент.ПроверитьЗаполнение();
	
	НовыйКонтрагент.Записать();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговор()
	
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();

	НовыйДоговор.Владелец		= Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "123");
	НовыйДоговор.Номер			= "1";
	НовыйДоговор.ДатаДоговора	= ТекущаяДата() + "пять";
	НовыйДоговор.ВидДоговора	= Перечисления.ВидыДоговоров.СПокупателем;
	НовыйДоговор.ЗаполнитьНаименованиеПоШаблону();
	
	НовыйДоговор.Записать();
	
КонецПроцедуры
			
#Область ИспользованиеЯвнойТранзакции

&НаКлиенте
Процедура СоздатьКонтрагентаИДоговор_ВТранзакции(Команда)
	СоздатьКонтрагентаИДоговор_ВТранзакцииНаСервере();

	ОповеститьОбИзменении(Тип("СправочникСсылка.Контрагенты"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.ДоговорыКонтрагентов"));

КонецПроцедуры

&НаСервере
Процедура СоздатьКонтрагентаИДоговор_ВТранзакцииНаСервере()
	
	НачатьТранзакцию();
	
	СоздатьКонтрагента();	
	
	СоздатьДоговор();	

	ЗафиксироватьТранзакцию();

КонецПроцедуры

#КонецОбласти
		
#Область БезИспользованияЯвнойТранзакции

&НаКлиенте
Процедура СоздатьКонтрагентаИДоговор_БезТранзакции(Команда)
	
	СоздатьКонтрагентаИДоговор_БезТранзакцииНаСервере();

	ОповеститьОбИзменении(Тип("СправочникСсылка.Контрагенты"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.ДоговорыКонтрагентов"));

КонецПроцедуры

&НаСервере
Процедура СоздатьКонтрагентаИДоговор_БезТранзакцииНаСервере()

	СоздатьКонтрагента();
	СоздатьДоговор();

КонецПроцедуры

#КонецОбласти
